sdaiPutAggrByIndex(Sdai_Id_aggr*,System.UInt32,SdaiPrimitiveType,BTEllipsis)
\details
Sets a new value (with possible coversion if necessary)
for a member fo a specified ordered aggregate instance referenced by a specified index.
\param aggregate [in] An aggregate instance.
\param index     [in] An index of the insertion place.
\param valueType [in] A value type.